# 여러 상품을 저장

lst = []
all_sell = 0

while True:
    dct = {}

    dct["code"] = (input("제품코드 입력: "))

    if dct["code"].lower() == "exit":
        break

    dct["name"] = input("제품명 입력: ")
    dct["num"] = int(input("수량 입력: "))
    dct["price"] = int(input("단가 입력: "))

    dct["sell"] = dct["num"] * dct["price"]
    lst.append(dct)
    print()


print("\n=============== 📦 상품 판매 현황 ====================")
print("\n  제품코드 \t 제품명 \t 수량 \t 단가 \t 판매금액 ")
print("====================================================")
print("====================================================")
for dct in lst:
    print("  %4s \t %8s \t %3d \t %3d \t %6d" %(dct["code"], dct["name"], dct["num"],dct["price"], dct["sell"]))
print("====================================================")
print("                   < 총 판매 금액 >")
for dct in lst:
    all_sell += dct["sell"]
print("총 판매 금액은: %30d" % all_sell)
print("====================================================")
print("====================================================")
print("                   ✔ 출력 완료 ✔")
print("====================================================")