# 2026.02.26
# list 안에 list

lst2 = []
all_sell = 0

while True:
    lst1 = []

    lst1.append(input("제품코드 입력: "))

    if lst1[0].lower() == "exit":
        break

    lst1.append(input("제품명 입력: "))
    lst1.append(int(input("수량 입력: ")))
    lst1.append(int(input("단가 입력: ")))

    lst1.append(lst1[2] * lst1[3])

    lst2.append(lst1)

    print()


print("\n=============== 📦 상품 판매 현황 ====================")
print("\n  제품코드 \t 제품명 \t 수량 \t 단가 \t 판매금액 ")
print("====================================================")
print("====================================================")
for i in lst2:
    print("  %4s \t %8s \t %3d \t %3d \t %6d" %(i[0], i[1], i[2], i[3], i[4]))
print("====================================================")
print("                   < 총 판매 금액 >")
for j in lst2:
    all_sell += j[4]
print("총 판매 금액은: %30d" % all_sell)
print("====================================================")
print("====================================================")
print("                   ✔ 출력 완료 ✔")
print("====================================================")